rhall510/stm32-rocket-avionics/firmware/avionics_stm32/Src/w25q.c
#include "w25q.h"
#include "stm32g4xx.h"


extern SPI_HandleTypeDef hspi2_str;


// Global variables to store metadata info
uint32_t MetaStartAddr = 1;   // Start address of the metadata sector (1 indicates empty start address)
uint32_t MetaEndAddr = 1;   // End address of the metadata sector (1 indicates empty end address)
uint32_t DataStartAddr = 0;   // Start address of the flight data block
uint32_t DataEndAddr = 0;   // Last byte address of the flight data block
uint8_t BadBlocks[64] = {0};   // Bytes represent 8 contiguous blocks with lowest address at LSB and highest at MSB. 1 if bad, 0 if ok.


bool InitialiseW25Q() {
	W25Q_Reset();

	// Check device ID
	uint8_t tx[4] = {0};
	uint8_t rx[4] = {0};

	tx[0] = W25Q_JEDECID;

	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_RESET);
	HAL_SPI_TransmitReceive(&hspi2_str, tx, rx, 4, W25Q_SPI_MAX_DELAY);
	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_SET);

	if (rx[1] != 0xEF || (((uint16_t)rx[2] << 8) + rx[3]) != 0x4019) {
		return false;
	}

	// Set to 4 byte address mode
	tx[0] = W25Q_4BYTE_ADDR_MODE;

	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi2_str, tx, 1, W25Q_SPI_MAX_DELAY);
	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_SET);

	W25Q_ReadMetadata();

	return true;
}


void W25Q_Reset() {
	// Enable software reset
	uint8_t tx[1] = {W25Q_ENABLE_RESET};

	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi2_str, tx, 1, W25Q_SPI_MAX_DELAY);
	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_SET);

	// Execute software reset
	tx[0] = W25Q_RESET;

	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi2_str, tx, 1, W25Q_SPI_MAX_DELAY);
	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_SET);

	HAL_Delay(1);   // Must wait at least 30uS
}


bool W25Q_CheckBusy() {
	// Read status 1 register
	uint8_t tx[2] = {W25Q_READ_STATUS1, 0};
	uint8_t rx[2] = {0};

	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_RESET);
	HAL_SPI_TransmitReceive(&hspi2_str, tx, rx, 2, W25Q_SPI_MAX_DELAY);
	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_SET);

	return rx[1] & 1;
}


void W25Q_EnableWrite() {
	uint8_t tx[1] = {W25Q_WRITE_ENABLE};

	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi2_str, tx, 1, W25Q_SPI_MAX_DELAY);
	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_SET);
}




bool W25Q_ReadMetadata() {
	MetaStartAddr = 1;   // 1 Indicates not found

	uint8_t tx[5] = {0};
	uint8_t rx[68] = {0};   // Allocate enough space for reading full metadata later

	tx[0] = W25Q_READ_4BADDR;

	// Read 8 bytes at the start of each block and check for metadata start identifier
	for (int block = 0; block < 512; block++) {
		uint32_t ReadAddr = (block << 16);
		for (int i = 3; i >= 0; i--) {   // Load block start address into tx
			tx[4 - i] = (uint8_t)((ReadAddr >> (i * 8)) & 0xFF);
		}

		HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_RESET);
		HAL_SPI_Transmit(&hspi2_str, tx, 5, W25Q_SPI_MAX_DELAY);
		HAL_SPI_Receive(&hspi2_str, rx, 8, W25Q_SPI_MAX_DELAY);
		HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_SET);

		bool found = true;
		for (int i = 0; i < 8; i++) {   // Check for metadata start ID
			if (rx[i] != (uint8_t)(W25Q_META_START_ID >> ((7 - i) * 8))) {
				found = false;
				break;
			}
		}

		if (found) {
			MetaStartAddr = ReadAddr;
			printf("Found metadata start at 0x%08lX\n", MetaStartAddr);
			break;
		}
	}

	// Create new metadata block if none found. Must assume no bad blocks and reset addresses to start
	if (MetaStartAddr == 1) {
		printf("Did not find metadata, writing blank...\n");
		MetaStartAddr = 0x0;
		DataStartAddr = 0x1000;
		DataEndAddr = 0x1000;   // No data

		for (int i = 0; i < 64; i++) {   // Clear all bad block flags
			BadBlocks[i] = 0x0;
		}

		W25Q_WriteMetadata(true);
		return false;
	}

	// Read existing metadata if found (4 byte data start address + 64 byte bad block array)
	uint32_t ReadAddr = MetaStartAddr + 8;
	for (int i = 3; i >= 0; i--) {   // Load read address into tx
		tx[4 - i] = (uint8_t)((ReadAddr >> (i * 8)) & 0xFF);
	}

	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi2_str, tx, 5, W25Q_SPI_MAX_DELAY);
	HAL_SPI_Receive(&hspi2_str, rx, 68, W25Q_SPI_MAX_DELAY);
	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_SET);

	DataStartAddr = ((uint32_t)rx[0] << 24) | ((uint32_t)rx[1] << 16) | ((uint32_t)rx[2] << 8) | rx[3];

	printf("Read data start at 0x%08lX\n", DataStartAddr);

	for (int i = 0; i < 64; i++) {   // Store bad block array
		BadBlocks[i] = rx[i + 4];
	}

//    printf("Injecting fake bad block at 0x20000\n");
//
//    int block = 2;
//    BadBlocks[block >> 3] |= (1U << (block & 0b111));

	MetaEndAddr = MetaStartAddr + 0xFFF;   // Reserve the entire sector for metadata


	// Find data end address
	ReadAddr = DataStartAddr;
	uint32_t LastValidEndAddr = DataStartAddr;
	while (1) {
		// Read 8 bytes at packet start: 4 byte sync word + 4 byte header
		W25Q_ReadVolumeSafe(ReadAddr, rx, 8);

		uint32_t sync = ((uint32_t)rx[0] << 24) | ((uint32_t)rx[1] << 16) | ((uint32_t)rx[2] << 8) | rx[3];
		if (sync == W25Q_DATA_SYNC_WORD) {
			uint32_t packetLen = ((uint16_t)rx[5] << 8) | rx[6];

			// Keep track of the last valid packet end
			LastValidEndAddr = W25Q_GetSafeContiguousReadAddressWithOffset(ReadAddr, packetLen - 1);

			// Increment read address to expected start of the next packet
			ReadAddr = W25Q_GetSafeContiguousReadAddressWithOffset(ReadAddr, packetLen);
		} else {
			DataEndAddr = LastValidEndAddr;
			break;
		}
	}

	printf("Found data end at 0x%08lX\n", DataEndAddr);

	return true;
}


void W25Q_WriteMetadata(bool ErasePrev) {
	if (ErasePrev && MetaStartAddr != 1) {
		W25Q_EraseSector(MetaStartAddr);
	}

	MetaStartAddr = W25Q_GetSafeMetadataAddress();   // Get first valid metadata address
	MetaEndAddr = MetaStartAddr + 0xFFF;      // Reserve the entire sector for metadata

	if (MetaStartAddr == 1) {
		printf("ERROR in W25Q_WriteMetadata: Cannot find valid metadata sector address\n");
		return;
	}

	uint8_t len = 76;
	uint8_t metadata[len];

	for (int i = 0; i < 8; i++) {   // Start identifier
	    metadata[i] = (uint8_t)(W25Q_META_START_ID >> ((7 - i) * 8));
	}

	for (int i = 0; i < 4; i++) {   // Data start address
	    metadata[i + 8] = (uint8_t)(DataStartAddr >> ((3 - i) * 8));
	}

	for (int i = 0; i < 64; i++) {   // Bad block array
		metadata[i + 12] = BadBlocks[i];
	}

	printf("Writing metadata to 0x%08lX\n", MetaStartAddr);

	W25Q_WriteVolume(MetaStartAddr, metadata, len, false);   // Write without address checking (already checked above)
}



