rhall510/stm32-rocket-avionics/firmware/avionics_stm32/Src/w25q.c
uint32_t W25Q_GetSafeContiguousWriteAddress(uint32_t Addr) {
	uint32_t SafeAddr = Addr;
	bool wrapped = false;

	// Do all checks and recheck if the address moves
	while (1) {
		// Check if the address extends beyond the end of memory
		if (SafeAddr > W25Q_MAX_ADDR) {
			SafeAddr = 0x0;

			if (wrapped) {
				printf("ERROR: Address wraparound twice in W25Q_GetSafeContiguousWriteAddress\n");
				return 0xFFFFFFFF;
			} else {
				printf("WARNING: Address wraparound in W25Q_GetSafeContiguousWriteAddress\n");
			}

			wrapped = true;
			continue;
		}

		// Check if the address is in the metadata sector
		if (SafeAddr <= MetaEndAddr && SafeAddr >= MetaStartAddr) {
			printf("WARNING: Address moved out of metadata sector in W25Q_GetSafeContiguousWriteAddress\n");
			SafeAddr = MetaEndAddr + 1;
			continue;
		}

		// Check if the address is in the data section
		if (DataEndAddr > DataStartAddr) {
			if (SafeAddr <= DataEndAddr && SafeAddr >= DataStartAddr) {
				printf("WARNING: Address moved out of data section in W25Q_GetSafeContiguousWriteAddress\n");
				SafeAddr = DataEndAddr + 1;
				continue;
			}
		} else if (DataEndAddr < DataStartAddr) {
			if (SafeAddr <= DataEndAddr || SafeAddr >= DataStartAddr) {
				printf("WARNING: Address moved out of data section in W25Q_GetSafeContiguousWriteAddress\n");
				SafeAddr = DataEndAddr + 1;
				continue;
			}
		}

		// Check if the address is in a bad block
		uint16_t BlockNum = SafeAddr >> 16;
		uint32_t BBStartAddr = SafeAddr & 0xFFFF0000;
		uint32_t BBEndAddr = BBStartAddr + 0xFFFF;

		if (BadBlocks[BlockNum >> 3] & (1U << (BlockNum & 0b111))) {
			SafeAddr = BBEndAddr + 1;
			printf("WARNING: Address moved out of bad block in W25Q_GetSafeContiguousWriteAddress\n");
			continue;
		}

		break;   // Break if all tests pass
	}

	return SafeAddr;
}


uint32_t W25Q_GetSafeContiguousReadAddress(uint32_t Addr) {
	uint32_t SafeAddr = Addr;

	// Do all checks and recheck if the address moves
	while (1) {
		// Check if the address extends beyond the end of memory
		if (SafeAddr > W25Q_MAX_ADDR) {
			printf("WARNING: Address wraparound in W25Q_GetSafeContiguousReadAddress\n");
			SafeAddr = 0x0;
			continue;
		}

		// Check if the address is in the metadata sector
		if (SafeAddr <= MetaEndAddr && SafeAddr >= MetaStartAddr) {
			printf("WARNING: Address moved out of metadata sector in W25Q_GetSafeContiguousReadAddress\n");
			SafeAddr = MetaEndAddr + 1;
			continue;
		}

		// Check if the address is in a bad block
		uint16_t BlockNum = SafeAddr >> 16;
		uint32_t BBStartAddr = SafeAddr & 0xFFFF0000;
		uint32_t BBEndAddr = BBStartAddr + 0xFFFF;

		if (BadBlocks[BlockNum >> 3] & (1U << (BlockNum & 0b111))) {
			SafeAddr = BBEndAddr + 1;
			printf("WARNING: Address moved out of bad block in W25Q_GetSafeContiguousReadAddress\n");
			continue;
		}

		break;   // Break if all tests pass
	}

	return SafeAddr;
}


uint32_t W25Q_GetSafeContiguousReadAddressWithOffset(uint32_t StartAddr, uint32_t Offset) {
	uint32_t SafeAddr = StartAddr;

	uint16_t PageLeft = 256 - (SafeAddr & 0xFF);
	uint32_t OffsetLeft = Offset;

	if (OffsetLeft >= PageLeft) {
		OffsetLeft -= PageLeft;
		SafeAddr += PageLeft;
	} else {
		SafeAddr += OffsetLeft;
		OffsetLeft = 0;
	}

	while (OffsetLeft > 0) {
		SafeAddr = W25Q_GetSafeContiguousReadAddress(SafeAddr);

		if (OffsetLeft >= 256) {
			OffsetLeft -= 256;
			SafeAddr += 256;
		} else {
			SafeAddr += OffsetLeft;
			OffsetLeft = 0;
		}
	}

	return W25Q_GetSafeContiguousReadAddress(SafeAddr);   // Return with a final safeing check for edge cases
}


uint32_t W25Q_GetSafeMetadataAddress() {
	uint32_t SafeAddr = 0x0;
	bool safe = false;

	uint16_t StartBlock = 0;
	if (MetaStartAddr != 1) {   // Start searching from the block immediately after the current metadata
		StartBlock = (MetaStartAddr >> 16) + 1;
	}

	// Check each block start address
	for (int i = 0; i < 512; i++) {
		uint16_t block = (StartBlock + i) % 512;   // Wrap block around to the beginning of memory
		SafeAddr = (block << 16);

		// Check if the address is in the data section
		if (DataEndAddr > DataStartAddr) {
			if (SafeAddr <= DataEndAddr && SafeAddr >= DataStartAddr) { continue; }
		} else if (DataEndAddr < DataStartAddr) {
			if (SafeAddr <= DataEndAddr || SafeAddr >= DataStartAddr) { continue; }
		}

		// Check if the address is in a bad block
		uint16_t BlockNum = SafeAddr >> 16;
		if (BadBlocks[BlockNum >> 3] & (1U << (BlockNum & 0b111))) { continue; }

		safe = true;
		break;   // Break if all tests pass
	}

	return safe ? SafeAddr : 1;
}




void W25Q_WriteAppendData(uint8_t *buff, uint32_t Len) {
	// Start exactly at the start address if memory is empty
	uint32_t NextWriteAddr = (DataStartAddr == DataEndAddr) ? DataStartAddr : DataEndAddr + 1;
	DataEndAddr = W25Q_WriteVolume(NextWriteAddr, buff, Len, true);

	printf("Flight data written. New bounds: 0x%08lX to 0x%08lX\n", DataStartAddr, DataEndAddr);
}


uint32_t W25Q_WriteVolume(uint32_t StartAddr, uint8_t *buff, uint32_t Len, bool CheckAddress) {
	uint32_t WriteAddr = StartAddr;
	if (CheckAddress) {
		WriteAddr = W25Q_GetSafeContiguousWriteAddress(WriteAddr);
	}

	uint32_t ToWrite = Len;
	uint32_t EndAddr = WriteAddr;

	// Write one page (256 bytes) at a time, checking for overflow into the next page
	while (ToWrite) {
		uint16_t PageRemain = 0x100 - (WriteAddr & 0xFF);
		uint16_t WriteLen = (ToWrite > PageRemain) ? PageRemain : ToWrite;

		W25Q_PageProgram(WriteAddr, buff + Len - ToWrite, WriteLen);

		ToWrite -= WriteLen;
		EndAddr = WriteAddr + WriteLen - 1;
		WriteAddr = EndAddr + 1;

		if (CheckAddress && ToWrite > 0) {   // Only safe address if we have more to write
			WriteAddr = W25Q_GetSafeContiguousWriteAddress(WriteAddr);
		}
	}

//	printf("Volume written between 0x%08lX and 0x%08lX\n", StartAddr, EndAddr);

	return EndAddr;
}


bool W25Q_PageProgram(uint32_t StartAddr, uint8_t *buff, uint16_t Len) {
	uint16_t PageRemain = 0x100 - (StartAddr & 0xFF);   // Check length of write doesn't cross page boundary

	if (Len > PageRemain) {
		printf("ERROR IN W25Q_PageProgram: Write exceeds page length\n");
		return false;
	}

	W25Q_EnableWrite();

	uint8_t tx[261];   // Allocate enough space for a full page
	tx[0] = W25Q_PAGE_PROG_4BADDR;

	for (int i = 3; i >= 0; i--) {   // Load start address into tx buffer
		tx[4 - i] = (uint8_t)((StartAddr >> (i * 8)) & 0xFF);
	}

