rhall510/stm32-rocket-avionics/firmware/avionics_stm32/Src/w25q.c
	for (int i = 0; i < Len; i++) {   // Load data into tx buffer
		tx[i + 5] = buff[i];
	}

	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi2_str, tx, Len + 5, W25Q_SPI_MAX_DELAY);
	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_SET);

	while (W25Q_CheckBusy()) {}

	return true;
}




void W25Q_EraseChip() {
	printf("Erasing whole chip...\n");

	W25Q_EnableWrite();

	uint8_t tx[1] = {W25Q_CHIP_ERASE};

	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi2_str, tx, 1, W25Q_SPI_MAX_DELAY);
	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_SET);

	while (W25Q_CheckBusy()) {}

	printf("Erased chip\n");
}


void W25Q_EraseSector(uint32_t SectorAddr) {
	W25Q_EnableWrite();

	uint8_t tx[5] = {0};
	tx[0] = W25Q_SECTOR_ERASE_4BADDR;

	for (int i = 3; i >= 0; i--) {   // Load sector address into tx buffer
		tx[4 - i] = (uint8_t)((SectorAddr >> (i * 8)) & 0xFF);
	}

	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi2_str, tx, 5, W25Q_SPI_MAX_DELAY);
	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_SET);

	while (W25Q_CheckBusy()) {}

	printf("Erased sector 0x%08lX\n", SectorAddr);
}


void W25Q_EraseBlock(uint32_t BlockAddr) {
	W25Q_EnableWrite();

	uint8_t tx[5] = {0};
	tx[0] = W25Q_BLOCK_ERASE_4BADDR;

	for (int i = 3; i >= 0; i--) {   // Load sector address into tx buffer
		tx[4 - i] = (uint8_t)((BlockAddr >> (i * 8)) & 0xFF);
	}

	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi2_str, tx, 5, W25Q_SPI_MAX_DELAY);
	HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_SET);

	while (W25Q_CheckBusy()) {}

	printf("Erased block 0x%08lX\n", BlockAddr);
}


void W25Q_EraseFlightData() {
	if (DataStartAddr == DataEndAddr) {
		printf("W25Q_EraseFlightData: No flight data to erase, returning early\n");
		return;
	}   // Return if no flight data to erase

	uint32_t StartSectorAddr = DataStartAddr & 0xFFFFF000;
	uint32_t EndSectorAddr = DataEndAddr & 0xFFFFF000;
	uint32_t CurrSectorAddr = StartSectorAddr;

	while (1) {
		W25Q_EraseSector(CurrSectorAddr);

		if (CurrSectorAddr == EndSectorAddr) { break; }   // End if the erased sector was the end sector

		CurrSectorAddr = W25Q_GetSafeContiguousReadAddress(CurrSectorAddr + 0x1000);   // Jump to the next safe sector

		// Failsafe in case the CurrSectorAddr wraps all the way around memory
		if (CurrSectorAddr == StartSectorAddr) {
			printf("ERROR: W25Q_EraseFlightData wrapped completely around memory\n");
			break;
		}
	}

	printf("Flight data erased between 0x%08lX and 0x%08lX\n", StartSectorAddr, EndSectorAddr);

	DataStartAddr = W25Q_GetSafeContiguousWriteAddress(EndSectorAddr + 0x1000);   // Move start position for new data to the next sector
	DataEndAddr = DataStartAddr;   // No data currently written
	W25Q_WriteMetadata(true);
}


void W25Q_ReadVolume(uint32_t StartAddr, uint8_t *buff, uint32_t MaxLen) {
	uint8_t tx[5];
	uint8_t rx[256];   // Allocate enough space for a full page

	tx[0] = W25Q_READ_4BADDR;

	uint32_t ReadLeft = MaxLen;
	uint32_t ReadAddr = StartAddr;
	uint32_t buffpos = 0;

	// Read one page at a time
	while (ReadLeft > 0) {
		uint16_t PageRemain = 0x100 - (ReadAddr & 0xFF);
		uint16_t ReadLen = 0;

		if (ReadLeft > PageRemain) {
			ReadLen = PageRemain;
		} else {
			ReadLen = ReadLeft;
		}

		for (int i = 3; i >= 0; i--) {   // Load start address into tx
			tx[4 - i] = (uint8_t)((ReadAddr >> (i * 8)) & 0xFF);
		}

		// Split the transmit and receive to save stack space for buffers
		HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_RESET);
		HAL_SPI_Transmit(&hspi2_str, tx, 5, W25Q_SPI_MAX_DELAY);
		HAL_SPI_Receive(&hspi2_str, rx, ReadLen, W25Q_SPI_MAX_DELAY);
		HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_SET);

		// Put data in buffer
		for (int i = 0; i < ReadLen; i++) {
			buff[i + buffpos] = rx[i];
		}

		ReadAddr += ReadLen;
		buffpos += ReadLen;
		ReadLeft -= ReadLen;
	}
}


void W25Q_OutputVolume(uint32_t StartAddr, uint32_t MaxLen) {
	uint8_t tx[5];
	uint8_t rx[256];   // Allocate enough space for a full page

	tx[0] = W25Q_READ_4BADDR;

	uint32_t ReadLeft = MaxLen;
	uint32_t ReadAddr = StartAddr;

	// Read one page at a time
	while (ReadLeft > 0) {
		uint16_t PageRemain = 0x100 - (ReadAddr & 0xFF);
		uint16_t ReadLen = 0;

		if (ReadLeft > PageRemain) {
			ReadLen = PageRemain;
		} else {
			ReadLen = ReadLeft;
		}

		for (int i = 3; i >= 0; i--) {   // Load start address into tx
			tx[4 - i] = (uint8_t)((ReadAddr >> (i * 8)) & 0xFF);
		}

		// Split the transmit and receive to save stack space for buffers
		HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_RESET);
		HAL_SPI_Transmit(&hspi2_str, tx, 5, W25Q_SPI_MAX_DELAY);
		HAL_SPI_Receive(&hspi2_str, rx, ReadLen, W25Q_SPI_MAX_DELAY);
		HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_SET);

		// Print out data
		printf("Read volume from 0x%08lX to 0x%08lX:\n", ReadAddr, ReadAddr + ReadLen - 1);
		for (int i = 0; i < ReadLen; i++) {
			printf("%02X ", rx[i]);
		}
		printf("\n");

		ReadAddr += ReadLen;
		ReadLeft -= ReadLen;
	}
}


void W25Q_ReadVolumeSafe(uint32_t StartAddr, uint8_t *buff, uint32_t MaxLen) {
	uint8_t tx[5];
	uint8_t rx[256];   // Allocate enough space for a full page

	tx[0] = W25Q_READ_4BADDR;

	uint32_t ReadLeft = MaxLen;
	uint32_t ReadAddr = W25Q_GetSafeContiguousReadAddress(StartAddr);
	uint32_t buffpos = 0;

	// Read one page at a time
	while (ReadLeft > 0) {
		uint16_t PageRemain = 0x100 - (ReadAddr & 0xFF);
		uint16_t ReadLen = 0;

		if (ReadLeft > PageRemain) {
			ReadLen = PageRemain;
		} else {
			ReadLen = ReadLeft;
		}

		for (int i = 3; i >= 0; i--) {   // Load start address into tx
			tx[4 - i] = (uint8_t)((ReadAddr >> (i * 8)) & 0xFF);
		}

		// Split the transmit and receive to save stack space for buffers
		HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_RESET);
		HAL_SPI_Transmit(&hspi2_str, tx, 5, W25Q_SPI_MAX_DELAY);
		HAL_SPI_Receive(&hspi2_str, rx, ReadLen, W25Q_SPI_MAX_DELAY);
		HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_SET);

		// Put data in buffer
		for (int i = 0; i < ReadLen; i++) {
			buff[i + buffpos] = rx[i];
		}

		ReadAddr = W25Q_GetSafeContiguousReadAddress(ReadAddr + ReadLen);
		buffpos += ReadLen;
		ReadLeft -= ReadLen;
	}
}


void W25Q_OutputVolumeSafe(uint32_t StartAddr, uint32_t MaxLen) {
	uint8_t tx[5];
	uint8_t rx[256];   // Allocate enough space for a full page

	tx[0] = W25Q_READ_4BADDR;

	uint32_t ReadLeft = MaxLen;
	uint32_t ReadAddr = W25Q_GetSafeContiguousReadAddress(StartAddr);

	// Read one page at a time
	while (ReadLeft > 0) {
		uint16_t PageRemain = 0x100 - (ReadAddr & 0xFF);
		uint16_t ReadLen = 0;

		if (ReadLeft > PageRemain) {
			ReadLen = PageRemain;
		} else {
			ReadLen = ReadLeft;
		}

		for (int i = 3; i >= 0; i--) {   // Load start address into tx
			tx[4 - i] = (uint8_t)((ReadAddr >> (i * 8)) & 0xFF);
		}

		// Split the transmit and receive to save stack space for buffers
		HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_RESET);
		HAL_SPI_Transmit(&hspi2_str, tx, 5, W25Q_SPI_MAX_DELAY);
		HAL_SPI_Receive(&hspi2_str, rx, ReadLen, W25Q_SPI_MAX_DELAY);
		HAL_GPIO_WritePin(W25Q_CS_PORT, W25Q_CS_PIN, GPIO_PIN_SET);

