rhall510/stm32-rocket-avionics/firmware/avionics_stm32/Src/w25q.c
		// Print out data
		printf("Read volume from 0x%08lX to 0x%08lX:\n", ReadAddr, ReadAddr + ReadLen - 1);
		for (int i = 0; i < ReadLen; i++) {
			printf("%02X ", rx[i]);
		}
		printf("\n");

		ReadAddr = W25Q_GetSafeContiguousReadAddress(ReadAddr + ReadLen);
		ReadLeft -= ReadLen;
	}
}


void W25Q_ScanBadBlocks() {
	printf("Initiating bad block scan...\n");

	W25Q_EraseChip();   // Erase all existing data

	uint8_t CheckPattern[256];
	for (int i = 0; i < 256; i++) {
		CheckPattern[i] = (uint8_t)i;
	}

	uint8_t Readback[256];

	uint16_t NumBadBlocks = 0;

	for (int block = 0; block < 512; block++) {
		printf("Testing block %i at address 0x%08lX      ", block, block * 0x10000);
		bool bad = false;
		for (int page = 0; page < 256; page++) {
			uint32_t PageAddr = block * 0x10000 + page * 0x100;

			W25Q_PageProgram(PageAddr, CheckPattern, 256);
			W25Q_ReadVolume(PageAddr, Readback, 256);

			for (int i = 0; i < 256; i++) {
				if (Readback[i] != CheckPattern[i]) {   // If a byte doesn't match, the block is bad
					bad = true;
					break;
				}
			}

			if (bad) { break; }   // Skip the rest of the block if a page is bad
		}

		if (bad) {
			BadBlocks[block >> 3] |= (1U << (block & 0b111));   // Set bit in bad blocks array
			printf("BAD\n");
			NumBadBlocks++;
		} else {
			printf("OK\n");
		}
	}

	printf("Done testing. Found %i bad blocks\n", NumBadBlocks);

	W25Q_EraseChip();   // Perform final erase to reset chip
	W25Q_WriteMetadata(true);   // Rewrite metadata with new array
}
















void Test_W25Q_Initialisation() {
    printf("Starting W25Q initialisation test\n");

    // Check initialization + JEDEC ID
    if (!InitialiseW25Q()) {
        printf("W25Q initialization failed\n");
        return;
    }
    printf("W25Q initialized - JEDEC ID verified\n");
    printf("Current section boundaries: MS=0x%08lX, ME=0x%08lX, DS=0x%08lX, DE=0x%08lX\n", MetaStartAddr, MetaEndAddr, DataStartAddr, DataEndAddr);
}


void Test_W25Q_Logging() {
    printf("Starting W25Q test\n");

//    for (int i = 0; i < 10; i++) {
//    	W25Q_EraseBlock(0x10000 * i);
//    }

    // Check initialization + JEDEC ID
    if (!InitialiseW25Q()) {
        printf("W25Q initialization failed\n");
        return;
    }
    printf("W25Q initialized - JEDEC ID verified\n");

    printf("MetaStartAddr is: 0x%08lX\n", MetaStartAddr);

    // Erase existing flight data
    printf("Erasing old flight data...\n");
    W25Q_EraseFlightData();
    printf("Flight data erased. DataStartAddr now: 0x%08lX\n", DataStartAddr);
    printf("MetaStartAddr is now: 0x%08lX\n", MetaStartAddr);

    // Write test packet
    uint8_t testPacket[16] = {0xAA, 0xBB, 0xBB, 0xAA, 0x01, 0x00, 0x10, 0x00, 0x10, 0x06, 'R', 'O', 'C', 'K', 'E', 'T'};

    printf("Writing 16 byte test packet...\n");
    W25Q_WriteAppendData(testPacket, sizeof(testPacket));

    // Read back
    printf("Reading back data from address 0x%08lX...\n", DataStartAddr);
    uint8_t readBuffer[16] = {0};
    W25Q_ReadVolumeSafe(DataStartAddr, readBuffer, sizeof(readBuffer));

    if (memcmp(testPacket, readBuffer, sizeof(testPacket)) == 0) {
        printf("Readback matched the written packet exactly\n");
    } else {
        printf("Readback mismatch\n");
        printf("Expected sync word: %02X %02X %02X %02X\n", testPacket[0], testPacket[1], testPacket[2], testPacket[3]);
        printf("Actual sync word  : %02X %02X %02X %02X\n", readBuffer[0], readBuffer[1], readBuffer[2], readBuffer[3]);
        printf("W25Q test complete\n\n");
        return;
    }

    // Test appending
    uint8_t testPacket2[16] = {0xAA, 0xBB, 0xBB, 0xAA, 0x01, 0x00, 0x10, 0x00, 0x10, 0x06, 'F', 'L', 'I', 'G', 'H', 'T'};

    printf("Writing second 16 byte test packet...\n");
    W25Q_WriteAppendData(testPacket2, sizeof(testPacket2));

    // Read back
    printf("Reading back data from address 0x%08lX...\n", DataStartAddr);
    uint8_t readBuffer2[16] = {0};
    W25Q_ReadVolumeSafe(DataStartAddr + sizeof(testPacket), readBuffer2, sizeof(readBuffer2));

    if (memcmp(testPacket2, readBuffer2, sizeof(testPacket2)) == 0) {
        printf("Readback matched the written packet exactly\n");
    } else {
        printf("Readback mismatch\n");
        printf("Expected sync word: %02X %02X %02X %02X\n", testPacket2[0], testPacket2[1], testPacket2[2], testPacket2[3]);
        printf("Actual sync word  : %02X %02X %02X %02X\n", readBuffer2[0], readBuffer2[1], readBuffer2[2], readBuffer2[3]);
        printf("W25Q test complete\n\n");
        return;
    }

    printf("W25Q test complete\n\n");
}



void Test_W25Q_BadBlocks() {
    printf("Starting W25Q bad block management test\n");

	for (int i = 0; i < 10; i++) {
		W25Q_EraseBlock(0x10000 * i);
	}

    // Check initialization + JEDEC ID
    if (!InitialiseW25Q()) {
        printf("W25Q initialization failed\n");
        return;
    }
    printf("W25Q initialized - JEDEC ID verified\n");

    printf("Current section boundaries: MS=0x%08lX, ME=0x%08lX, DS=0x%08lX, DE=0x%08lX\n", MetaStartAddr, MetaEndAddr, DataStartAddr, DataEndAddr);

    printf("Injecting fake bad block at 0x20000\n");

    int block = 2;
    BadBlocks[block >> 3] |= (1U << (block & 0b111));

    printf("Writing ~735 pages (188300 bytes) of test data. Should span from 0x1000 to 0x3FF8B and skip the metadata and bad block...\n");

    uint8_t testPacket[100];
    uint8_t header[10] = {0xAA, 0xBB, 0xBB, 0xAA, 0x01, 0x00, 0x64, 0x00, 0x10, 0x5A};

    for (int i = 0; i < 100; i++) {
    	if (i < 10) {
    		testPacket[i] = header[i];
    	} else {
    		testPacket[i] = i - 9;
    	}
    }

    for (int i = 0; i < 1883; i++) {
    	W25Q_WriteAppendData(testPacket, 100);
    }

    // Read back
    printf("Reading back data from address 0x%08lX...\n", DataStartAddr);
    W25Q_OutputVolumeSafe(DataStartAddr, 200000);

//    W25Q_ScanBadBlocks();
}


void Test_W25Q_Wraparound() {
    printf("Starting W25Q wraparound management test\n");

	for (int i = 0; i < 10; i++) {
		W25Q_EraseBlock(0x10000 * i);
	}

    // Check initialization + JEDEC ID
    if (!InitialiseW25Q()) {
        printf("W25Q initialization failed\n");
        return;
    }
    printf("W25Q initialized - JEDEC ID verified\n");

    printf("Current section boundaries: MS=0x%08lX, ME=0x%08lX, DS=0x%08lX, DE=0x%08lX\n", MetaStartAddr, MetaEndAddr, DataStartAddr, DataEndAddr);

    printf("Injecting fake bad block at 0x1FF0000\n");

    int block = 511;
    BadBlocks[block >> 3] |= (1U << (block & 0b111));

    printf("Moving empty data section to the last sector address: 0x1FEF000\n");
    DataStartAddr = 0x1FEF000;
    DataEndAddr = 0x1FEF000;

    printf("Writing 25 pages (6400 bytes) of test data. Should span from 0x1FEF000 to 0x900...\n");

    uint8_t testPacket[100];
    uint8_t header[10] = {0xAA, 0xBB, 0xBB, 0xAA, 0x01, 0x00, 0x64, 0x00, 0x10, 0x5A};

    for (int i = 0; i < 100; i++) {
    	if (i < 10) {
    		testPacket[i] = header[i];
    	} else {
    		testPacket[i] = i - 9;
    	}
    }

    for (int i = 0; i < 64; i++) {
    	W25Q_WriteAppendData(testPacket, 100);
    }

    // Read back
    printf("Reading back data from address 0x%08lX...\n", DataStartAddr);
    W25Q_OutputVolumeSafe(DataStartAddr, 7000);
}









